{"author":"Matthew Vaughan","authorUrl":"https://www.google.com/maps/contrib/111282147078876397671?hl=en","rating":5,"content":"Can't fault this place at all. Maybe not everyone's cup of tea but it's extremely popular and I took notice of the clientele to whom this place serves. There were people who were obviously office workers, construction workers, people who were eating before a night out and people who lived locally. I could go on...\nThe atmosphere is so friendly, as are the staff. Very well organised and the owner was very astute and was very apt at serving and treating people from all walks of life with an air of humanity that made it a warm environment; brought people together.\nI took some photos a couple of weeks back and he came out, invited me in and made me feel welcome with an offer of some food. He said I could take some photos inside the premises - which I did.\nI asked a few of the customers what they thought and they all said it was a great place and that the food spoke for itself.\nI told the owner I'd be back and I took my friend with me.\nThe set up is a series of benches and tables, reminiscent of a School dining hall, with little decor but don't let that put you off.\nI thought at first that the portions were a bit small but I was fooled. You get a healthy portion and we were given what we left - which was pretty much a full third meal.\nThe place is hidden down a side street and you'd wonder how it would thrive as a business but as you can see from my review,  that's how it advertises itself.\nIt certainly 'is' a hidden gem in a busy part of The Northern Quarter, Manchester.\nIt's a takeaway too and I noticed a lot of people using it as such.\nWhat I would say, is if you want a five star candlelit romantic dinner, then this isn't the place for you - but if you want Indian food and a humble but warm environment, then this is your place.\nThe food does speak for itself by the way.\nI personally couldn't fault this place and as a regular Manchester Photographer, I'll always stick my neck out to advertise this place 😁","date":"2022-03-18T20:28:16.272Z"}
